FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_Timer.c
/*-------------------------------------------------------------------------*
 * File:  Timer.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC1768 Timers Interface.
 * Implementation:
 *      Two Timers are created, Timer0 and Timer1.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZErrors.h>
#include <uEZProcessor.h>
#include <HAL/GPIO.h>
#include <HAL/Timer.h>
#include <uEZBSP.h>
#include <HAL/Interrupt.h>
#include <uEZPlatformAPI.h>
#include <Source/Processor/NXP/LPC1768/LPC1768_Timer.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
//typedef TIM_TypeDef T_LPC1768_Timer_Registers;

typedef struct {
    TUInt16 iVector;
    TISRFPtr iISR;
    const char *iName;
    TUInt8 iPCONBitIndex;
} T_LPC1768_Timer_Info;

typedef struct {
    T_HALTimer_Callback iCallbackFunc;
    void *iCallbackWorkspace;
} T_LPC1768_Timer_InterruptCallback;

/*
typedef struct {
    const HAL_Timer *iHAL;
    T_LPC1768_Timer_Registers *iReg;
    TUInt32 iPeriod;
} T_LPC1768_Timer_Workspace;
*/

typedef struct {
    TVUInt32 iIR; // 0x00
    TVUInt32 iTCR; // 0x04
    TVUInt32 iTC; // 0x08
    TVUInt32 iPR; // 0x0C
    TVUInt32 iPC; // 0x10
    TVUInt32 iMCR; // 0x14
    TVUInt32 iMR[4]; // 0x18, 0x1C, 0x20, 0x24
    TVUInt32 iCCR; // 0x28
    TVUInt32 iCR[4]; // 0x2C, 0x30, 0x34, 0x38
    TVUInt32 iEMR; // 0x3C
    TVUInt32 ireserved1[4]; // 0x40, 0x44, 0x48, 0x4C
    TVUInt32 ireserved2[4]; // 0x50, 0x54, 0x58, 0x5C
    TVUInt32 ireserved3[4]; // 0x60, 0x64, 0x68, 0x6C
    TVUInt32 iCTCR; // 0x70
} T_LPC1768_Timer_Registers;

typedef struct {
    const HAL_Timer *iHAL;
    T_LPC1768_Timer_Registers *iReg;
    T_LPC1768_Timer_InterruptCallback iCallbacks[4]; // one per match register
    const T_LPC1768_Timer_Info *iInfo;
} T_LPC1768_Timer_Workspace;



/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static const T_LPC1768_Timer_Info G_Timer0_Info;
static const T_LPC1768_Timer_Info G_Timer1_Info;
static const T_LPC1768_Timer_Info G_Timer2_Info;
static const T_LPC1768_Timer_Info G_Timer3_Info;
T_LPC1768_Timer_Workspace *G_Timer0_Workspace;
T_LPC1768_Timer_Workspace *G_Timer1_Workspace;
T_LPC1768_Timer_Workspace *G_Timer2_Workspace;
T_LPC1768_Timer_Workspace *G_Timer3_Workspace;
static void ITimerProcessIRQ(T_LPC1768_Timer_Workspace *p);


/*---------------------------------------------------------------------------*
 * Routine:  ITimerProcessIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Routine called when IRQ occurs.  Determines which callbacks to
 *      call (if any) and clears the interrupts.
 * Inputs:
 *      T_LPC247x_Timer_Workspace *p -- Timer workspace
 *---------------------------------------------------------------------------*/
static void ITimerProcessIRQ(T_LPC1768_Timer_Workspace *p)
{
    // Look at the registers and see which are causing an interrupt
    TUInt8 ir = p->iReg->iIR;
    if (ir & (1 << 0)) {
        // Match register 0
        if (p->iCallbacks[0].iCallbackFunc)
            p->iCallbacks[0].iCallbackFunc(p->iCallbacks[0].iCallbackWorkspace);
    }
    if (ir & (1 << 1)) {
        // Match register 1
        if (p->iCallbacks[1].iCallbackFunc)
            p->iCallbacks[1].iCallbackFunc(p->iCallbacks[1].iCallbackWorkspace);
    }
    if (ir & (1 << 2)) {
        // Match register 2
        if (p->iCallbacks[2].iCallbackFunc)
            p->iCallbacks[2].iCallbackFunc(p->iCallbacks[2].iCallbackWorkspace);
    }
    if (ir & (1 << 3)) {
        // Match register 3
        if (p->iCallbacks[3].iCallbackFunc)
            p->iCallbacks[3].iCallbackFunc(p->iCallbacks[3].iCallbackWorkspace);
    }
    // Clear interrupts called in this pass (if another one came in, we'll get it
    // on the next interrupt).
    p->iReg->iIR = ir;
}

/*---------------------------------------------------------------------------*
 * Routine:  TimerX_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      Interrupt service routines
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Timer0_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer0_Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(Timer1_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer1_Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(Timer2_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer2_Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(Timer3_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer3_Workspace);
    IRQ_END()
    ;
}







/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_SetTimerMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Timer is going to start -- chip select enabled for device
 * Inputs:
 *      void *aWorkspace        -- Workspace for Timer
 *      T_Timer_Mode aMode      -- Timer mode of operation
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE if success, else code.
 *---------------------------------------------------------------------------*/
static T_uezError LPC1768_Timer_SetTimerMode(
        void *aWorkspace,
        T_Timer_Mode aMode)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;

    // Setup the mode
    r->iCTCR = (r->iCTCR & ~3)|aMode;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_SetCaptureSource
 *---------------------------------------------------------------------------*
 * Description:
 *      Timer is going to start -- chip select enabled for device
 * Inputs:
 *      void *aWorkspace        -- Workspace for Timer
 *      TUInt32 aSourceIndex    -- Timer capture source (depends on hardware
 *                                   underneath).
 * Outputs:
 *      T_uezError              -- Error code.  UEZ_ERROR_NONE if success.
 *                                  UEZ_ERROR_NOT_FOUND if source index
 *                                  does not exist.
 *---------------------------------------------------------------------------*/
static T_uezError LPC1768_Timer_SetCaptureSource(
        void *aWorkspace,
        TUInt32 aSourceIndex)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;

    if (aSourceIndex > 1)
        return UEZ_ERROR_NOT_FOUND;

