FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_Timer.c
    // Setup the source of the capture
    r->iCTCR = (r->iCTCR & ~(3<<2))|(aSourceIndex<<2);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_SetMatchRegister
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup one of several timer's match registers and what do on
 *      a match.
 * Outputs:
 *      void *aWorkspace        -- Timer's workspace
 *      TUInt8 aMatchRegister   -- Index to match register (0-3)
 *      TUInt32 aMatchPoint     -- Number of PWM cycles until match
 *      TBool aDoInterrupt      -- ETrue if want an interrupt, else EFalse
 *                                  (NOTE: Interrupts currently not
 *                                  implemented)
 *      TBool aDoCounterReset   -- ETrue if counter for this Timer is
 *                                  to be reset on match.
 *      TBool aDoStop           -- ETrue if counter is to be stopped
 *                                  when match occurs.
 *---------------------------------------------------------------------------*/
static T_uezError LPC1768_Timer_SetMatchRegister(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        TUInt32 aMatchPoint,
        TBool aDoInterrupt,
        TBool aDoCounterReset,
        TBool aDoStop)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;
    TUInt32 aFlags = 0;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Determine what the combined flags are
    if (aDoInterrupt)
        aFlags |= (1<<0);
    if (aDoCounterReset)
        aFlags |= (1<<1);
    if (aDoStop)
        aFlags |= (1<<2);

    // Set the actions on the match
    r->iMCR &= ~(7<<(aMatchRegister*3));
    r->iMCR |= (aFlags<<(aMatchRegister*3));

    // Change the match register
    (&r->iMR[0])[aMatchRegister] = aMatchPoint;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_SetExternalControl
 *---------------------------------------------------------------------------*
 * Description:
 *      Timer is going to have a single edge output (high until matches, then
 *      low, reset counter goes back to high).
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *      TUInt8 aMatchRegister   -- Point in Fpclk cycles where Timer switches
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
static T_uezError LPC1768_Timer_SetExternalControl(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        T_Timer_ExternalControl aExtControl)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Change the external control
    r->iEMR &= ~(3<<(4+aMatchRegister*2));
    r->iEMR |= (aExtControl<<(4+aMatchRegister*2));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Reset the timer's counter.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *---------------------------------------------------------------------------*/
static void LPC1768_Timer_Reset(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;
    int i;

    // Reset the counter
    r->iTCR |= (1<<1);

    // Small delay to let the timer reset
    for (i=0; i<5; i++)
        {}

    // Release the counter
    r->iTCR &= ~(1<<1);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable (run) the timer's counter.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *---------------------------------------------------------------------------*/
static void LPC1768_Timer_Enable(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;

    // Enable the counter
    r->iTCR |= (1<<0);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_Disable
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable the timer's counter.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *---------------------------------------------------------------------------*/
static void LPC1768_Timer_Disable(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;

    // Disable the counter
    r->iTCR &= ~(1<<0);
}

/*---------------------------------------------------------------------------*
 * Routine:  IClear
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear all the callback information for this workspace
 * Inputs:
 *      T_LPC247x_Timer_Workspace *p  -- Particular Timer workspace
 *---------------------------------------------------------------------------*/
static void IClear(T_LPC1768_Timer_InterruptCallback aCallbacks[4])
{
    TUInt8 i;
    for (i = 0; i < 4; i++) {
        aCallbacks[i].iCallbackFunc = 0;
        aCallbacks[i].iCallbackWorkspace = 0;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1768 Timer0 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_Timer0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1768_Timer_Registers *)TIM0_BASE;
    p->iInfo = &G_Timer0_Info;
    IClear(p->iCallbacks);

    G_Timer0_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1768 Timer1 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_Timer1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1768_Timer_Registers *)TIM1_BASE;
    p->iInfo = &G_Timer1_Info;
    IClear(p->iCallbacks);

    G_Timer1_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1768 Timer1 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_Timer2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1768_Timer_Registers *)TIM2_BASE;
    p->iInfo = &G_Timer2_Info;
    IClear(p->iCallbacks);

    G_Timer2_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1768 Timer1 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_Timer3_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC1768_Timer_Registers *)TIM3_BASE;
    p->iInfo = &G_Timer3_Info;
    IClear(p->iCallbacks);

