FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_Timer.c
    G_Timer3_Workspace = p;

    return UEZ_ERROR_NONE;
}



/*---------------------------------------------------------------------------*
 * Routine:  LPC247x_Timer_SetMatchCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup a callback routine for this timer on one of the match
 *      registers.  The callback is called when a match occurs and an
 *      interrupt occurs.  The callback is called from within the ISR.
 * Inputs:
 *      void *aWorkspace -- Timer workspace
 *      TUInt8 aMatchRegister -- Which match register to set callback
 *      T_Timer_Callback aCallbackFunc -- Function to call, or 0 to clear.
 *      void *aCallbackWorkspace -- Workspace to pass to callback
 * Outputs:
 *      T_uezError -- UEZ_ERROR_ILLEGAL_PARAMETER if match register is out
 *          of range.
 *---------------------------------------------------------------------------*/
static T_uezError LPC1768_Timer_SetMatchCallback(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        T_HALTimer_Callback aCallbackFunc,
        void *aCallbackWorkspace)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    TBool any;
    TUInt8 i;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Set the callback (which can be 0 as well as an address)
    p->iCallbacks[aMatchRegister].iCallbackFunc = aCallbackFunc;
    p->iCallbacks[aMatchRegister].iCallbackWorkspace = aCallbackWorkspace;

    // Check to see if there are any callbacks
    any = EFalse;
    for (i = 0; i < 4; i++) {
        if (p->iCallbacks[i].iCallbackFunc) {
            any = ETrue;
            break;
        }
    }

    // Register or deregister the interrupt
    if (any) {
        // Register if not already registered
        if (!InterruptIsRegistered(p->iInfo->iVector))
            InterruptRegister(p->iInfo->iVector, p->iInfo->iISR,
                    INTERRUPT_PRIORITY_HIGH, p->iInfo->iName);
        InterruptEnable(p->iInfo->iVector);
    } else {
        // No one registered anymore, turn off this callback (but leave registered)
        InterruptDisable(p->iInfo->iVector);
    }
    return UEZ_ERROR_NONE;
}


/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_Timer_SetMatchRegisterFunctions
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup one of several timer's match registers and what to do on
 *      a match.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *      TUInt8 aMatchRegister   -- Index to match register (0-3)
 *      T_Timer_MatchPointFunction aFunctions -- List of functions to perform
 *          when the timer reaches this match point.
 *      TUInt32 aMatchPoint -- Point at which functions trigger
 * Outputs:
 *      T_uezError -- Returns UEZ_ERROR_ILLEGAL_PARAMETER if match register
 *          does not exist.  Returns UEZ_ERROR_ILLEGAL_OPERATION if a
 *          function in aFunctions is not supported.  Otherwise, returns
 *          UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
static T_uezError LPC1768_Timer_SetMatchRegisterFunctions(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        T_Timer_MatchPointFunction aFunctions,
        TUInt32 aMatchPoint)
{
    T_LPC1768_Timer_Workspace *p = (T_LPC1768_Timer_Workspace *)aWorkspace;
    T_LPC1768_Timer_Registers *r = p->iReg;
    TUInt32 aFlags = 0;
    const T_LPC1768_Timer_Info *p_info = p->iInfo;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    //Make sure Power to the Timer is turned on
    LPC1768PowerOn(1UL << p_info->iPCONBitIndex);

    if (aFunctions & ~(TIMER_MATCH_POINT_FUNC_INTERRUPT
            | TIMER_MATCH_POINT_FUNC_RESET | TIMER_MATCH_POINT_FUNC_STOP))
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Determine what the combined flags are
    if (aFunctions & TIMER_MATCH_POINT_FUNC_INTERRUPT)
        aFlags |= (1 << 0);
    if (aFunctions & TIMER_MATCH_POINT_FUNC_RESET)
        aFlags |= (1 << 1);
    if (aFunctions & TIMER_MATCH_POINT_FUNC_STOP)
        aFlags |= (1 << 2);

    // Set the actions on the match
    r->iMCR &= ~(7 << (aMatchRegister * 3));
    r->iMCR |= (aFlags << (aMatchRegister * 3));

    // Change the match register
    r->iMR[aMatchRegister] = aMatchPoint / (PROCESSOR_OSCILLATOR_FREQUENCY
        / PCLK_FREQUENCY);

    return UEZ_ERROR_NONE;
}


/*---------------------------------------------------------------------------*
 * Internal Information tables:
 *---------------------------------------------------------------------------*/
static const T_LPC1768_Timer_Info G_Timer0_Info = {
        TIMER0_IRQn,
        (TISRFPtr)Timer0_ISR,
        "Timer0",
        1, };

static const T_LPC1768_Timer_Info G_Timer1_Info = {
        TIMER1_IRQn,
        (TISRFPtr)Timer1_ISR,
        "Timer1",
        2, };

static const T_LPC1768_Timer_Info G_Timer2_Info = {
        TIMER2_IRQn,
        (TISRFPtr)Timer2_ISR,
        "Timer2",
        22, };

static const T_LPC1768_Timer_Info G_Timer3_Info = {
        TIMER3_IRQn,
        (TISRFPtr)Timer3_ISR,
        "Timer3",
        23, };

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_Timer LPC1768_Timer0_Interface = {
    {
    "NXP:LPC1768:Timer0",
    0x0100,
    LPC1768_Timer0_InitializeWorkspace,
    sizeof(T_LPC1768_Timer_Workspace),
    },

    LPC1768_Timer_SetTimerMode,
    LPC1768_Timer_SetCaptureSource,
    LPC1768_Timer_SetMatchRegister,
    LPC1768_Timer_SetExternalControl,
    LPC1768_Timer_Reset,
    LPC1768_Timer_Enable,
    LPC1768_Timer_Disable,
    LPC1768_Timer_SetMatchCallback,
    LPC1768_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC1768_Timer1_Interface = {
    {
    "NXP:LPC1768:Timer1",
    0x0100,
    LPC1768_Timer1_InitializeWorkspace,
    sizeof(T_LPC1768_Timer_Workspace),
    },

    LPC1768_Timer_SetTimerMode,
    LPC1768_Timer_SetCaptureSource,
    LPC1768_Timer_SetMatchRegister,
    LPC1768_Timer_SetExternalControl,
    LPC1768_Timer_Reset,
    LPC1768_Timer_Enable,
    LPC1768_Timer_Disable,
    LPC1768_Timer_SetMatchCallback,
    LPC1768_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC1768_Timer2_Interface = {
    {
    "NXP:LPC1768:Timer2",
    0x0100,
    LPC1768_Timer2_InitializeWorkspace,
    sizeof(T_LPC1768_Timer_Workspace),
    },

    LPC1768_Timer_SetTimerMode,
    LPC1768_Timer_SetCaptureSource,
    LPC1768_Timer_SetMatchRegister,
    LPC1768_Timer_SetExternalControl,
    LPC1768_Timer_Reset,
    LPC1768_Timer_Enable,
    LPC1768_Timer_Disable,
    LPC1768_Timer_SetMatchCallback,
    LPC1768_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC1768_Timer3_Interface = {
    {
    "NXP:LPC1768:Timer3",
    0x0100,
    LPC1768_Timer3_InitializeWorkspace,
    sizeof(T_LPC1768_Timer_Workspace),
    },

    LPC1768_Timer_SetTimerMode,
    LPC1768_Timer_SetCaptureSource,
    LPC1768_Timer_SetMatchRegister,
    LPC1768_Timer_SetExternalControl,
    LPC1768_Timer_Reset,
    LPC1768_Timer_Enable,
    LPC1768_Timer_Disable,
    LPC1768_Timer_SetMatchCallback,
    LPC1768_Timer_SetMatchRegisterFunctions,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1768_Timer0_Require(const T_LPC1768_Timer_Settings *aSettings)
{
    static const T_LPC1768_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_26, IOCON_D_DEFAULT(3)}, // T0_CAP0
    };
    static const T_LPC1768_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_27, IOCON_D_DEFAULT(3)}, // T0_CAP1
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P1_28, IOCON_D_DEFAULT(3)}, // T0_MAT0
            {GPIO_P3_25, IOCON_D_DEFAULT(3)}, // T0_MAT0
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P1_29, IOCON_D_DEFAULT(3)}, // T0_MAT1
            {GPIO_P3_26, IOCON_D_DEFAULT(3)}, // T0_MAT0
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer0
    HALInterfaceRegister("Timer0", (T_halInterface *)&LPC1768_Timer0_Interface,
            0, 0);
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[2], 0, 0);
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC1768_Timer1_Require(const T_LPC1768_Timer_Settings *aSettings)
{
    static const T_LPC1768_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P1_18, IOCON_D_DEFAULT(3)}, // T1_CAP0
    };
    static const T_LPC1768_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P1_19, IOCON_D_DEFAULT(3)}, // T1_CAP1
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P1_22, IOCON_D_DEFAULT(3)}, // T1_MAT0
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P1_25, IOCON_D_DEFAULT(3)}, // T1_MAT1
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer1
    HALInterfaceRegister("Timer1", (T_halInterface *)&LPC1768_Timer1_Interface,
            0, 0);
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC1768_Timer2_Require(const T_LPC1768_Timer_Settings *aSettings)
{
    static const T_LPC1768_IOCON_ConfigList pinsCAP0[] = {
            {GPIO_P0_4,  IOCON_D_DEFAULT(3)}, // T2_CAP0
            {GPIO_P1_14, IOCON_D_DEFAULT(3)}, // T2_CAP0
            {GPIO_P2_6,  IOCON_D_DEFAULT(3)}, // T2_CAP0
    };
    static const T_LPC1768_IOCON_ConfigList pinsCAP1[] = {
            {GPIO_P0_5,  IOCON_D_DEFAULT(3)}, // T2_CAP1
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT0[] = {
            {GPIO_P0_6,  IOCON_D_DEFAULT(3)}, // T2_MAT0
            {GPIO_P2_5,  IOCON_D_DEFAULT(3)}, // T2_MAT0
            {GPIO_P4_28, IOCON_D_DEFAULT(3)}, // T2_MAT0
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT1[] = {
            {GPIO_P0_7,  IOCON_W_DEFAULT(3)}, // T2_MAT1
            {GPIO_P2_4,  IOCON_D_DEFAULT(3)}, // T2_MAT1
            {GPIO_P4_29, IOCON_D_DEFAULT(3)}, // T2_MAT1
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT2[] = {
            {GPIO_P0_8,  IOCON_W_DEFAULT(3)}, // T2_MAT2
            {GPIO_P2_3,  IOCON_D_DEFAULT(3)}, // T2_MAT2
    };
    static const T_LPC1768_IOCON_ConfigList pinsMAT3[] = {
            {GPIO_P0_9,  IOCON_W_DEFAULT(3)}, // T2_MAT3
            {GPIO_P2_2,  IOCON_D_DEFAULT(3)}, // T2_MAT3
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer2
    HALInterfaceRegister("Timer2", (T_halInterface *)&LPC1768_Timer2_Interface,
            0, 0);
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC1768_IOCON_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT3,
            ARRAY_COUNT(pinsMAT3));
}

